routes/breadcrumbs.php

select * from `dialogs` where `user_id` = 12 or `client_id` = 12
select * from `messages` where `messages`.`dialog_id` in (2)
---
});
Breadcrumbs::register('cabinet.messages.all', function (BreadcrumbsGenerator $crumbs) {
    $user = Auth::id();
    $allDialogs = Dialog::where('user_id',$user)->orWhere('client_id',$user)->with(['client','messages','advert'])->get();