app/Http/Controllers/Cabinet/MessageController.php

    public function index()
    {
        $user = Auth::id();
        $allDialogs = Dialog::where('user_id',$user)->orWhere('client_id',$user)->with(['client','messages','advert'])->get();
---
select * from `dialogs` where `user_id` = 472 or `client_id` = 472
select * from `messages` where `messages`.`dialog_id` in (5)

    public function delete(Request $request)
    {
        Dialog::destroy($request->input('id'));
---
delete from `dialogs` where `id` = 47

    public function showAllMessages(Request $request)
    {
        $user_id = \Auth::id();
        $dialog = Dialog::findOrFail($request->input('dialog'));
        /*Read messages*/
        $user_id == $dialog->user_id ? $dialog->readByOwner() : $dialog->readByClient();
        $dialog = Dialog::where('id', $request->input('dialog'))->with(['messages','advert'])->get();
---
select * from `users` where `users`.`id` = 573 limit 1
select * from `dialogs` where `id` = '2'
select * from `messages` where `messages`.`dialog_id` in (2)