app/Http/Controllers/HomeController.php

select * from `regions`
---
    public function index()
    {
        $categories = Category::whereIsRoot()->defaultOrder()->getModels();
        $allRegions = \Cache::tags(['allRegions'])->rememberForever('allRegions',function(){
            return Region::all()->groupBy('parent_id');