app/Providers/AuthServiceProvider.php

select * from `users` where `email` = 'trantow.ethyl@example.org' limit 1
---
    public function boot()
    {
        $this->registerPolicies();

        //
        Gate::define('admin-panel', function(User $user){
           return $user->isAdmin();
        });

        Gate::define('manage-users', function(User $user){
            return $user->isAdmin();
        });

        Gate::define('manage-regions', function(User $user){
            return $user->isAdmin();
        });

        Gate::define('manage-pages', function(User $user){
            return $user->isAdmin();
        });

        Gate::define('manage-adverts-categories', function(User $user){
            return $user->isAdmin();
        });

        Gate::define('edit-own-advert', function(User $user, Advert $advert){
            return User::where('email',$user->email)->first()->id == $advert->user_id;

select * from `users` where `email` = 'trantow.ethyl@example.org' limit 1
---
            return $user->isAdmin() || $user->isModerator();
        });
        Gate::define('manage-own-advert', function(User $user, Advert $advert){
            return $advert->user_id == User::where('email',$user->email)->first()->id;